Revit 2027 API
ExternalDataManagerDataItem.Count Property
 The count of the data item.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Count { get; set; }
Public Property Count As Integer
	Get
	Set
public:
property int Count {
	int get ();
	void set (int value);
}
member Count : int with get, set
Property Value
Int32
Remarks
 The default value is -1, means this property is nonsense.
See Also
Reference
ExternalDataManagerDataItem Class
Autodesk.Revit.UI Namespace